/**********************************************************************************
// Green (Código Fonte)
//
// Criação:     15 Out 2012
// Atualização: 01 Nov 2021
// Compilador:  Visual C++ 2019
//
// Descrição:   Objeto faz uma fuga suavizada
//
**********************************************************************************/

#include "Tail.h"
#include "GeoWars.h"
#include "Random.h" 

// ---------------------------------------------------------------------------------

Tail::Tail(Player* p) : player(p)
{
    sprite = new Sprite("Resources/cobra-Sprite-1.png");
    speed = new Vector(0, 2.0f);
    BBox(new Circle(20.0f));
    type = TAIL;
}


// ---------------------------------------------------------------------------------

Tail::~Tail()
{
    delete sprite;
    delete speed;
}

// -------------------------------------------------------------------------------

void Tail::OnCollision(Object* obj)
{

}

// -------------------------------------------------------------------------------

void Tail::Update()
{

}

// -------------------------------------------------------------------------------